# Latihan

## CREATE DATABASE

In [2]:
# import module 
import mysql.connector

# koneksi server
db1 = mysql.connector.connect(
  host='localhost',
  user='bakti',
  passwd='123'
)

# membuat objek 'cursor` sebagai kata kunci eksekusi SQL
cursor1 = db1.cursor()

# Perintah SQL
sql='''CREATE DATABASE IF NOT EXISTS join_tabel'''

# Eksekusi perintah  SQL
cursor1.execute(sql)

## Check List Database

In [3]:
# Perintah SQL
sql = 'SHOW DATABASES'

# Eksekusi perintah  SQL
cursor1.execute(sql)

# menampilkan daftar database
for x in cursor1:
  print(x)

('information_schema',)
('jne2',)
('jne4',)
('join_tabel',)
('mysql',)
('performance_schema',)
('phpmyadmin',)
('test',)
('unique_id',)

## CREATE TABEL

# import module 
import mysql.connector

# koneksi server
db2 = mysql.connector.connect(
  host='localhost',
  user='bakti',
  passwd='123',
  database='join_tabel'
)

# membuat objek 'cursor` sebagai kata kunci eksekusi SQL
cursor2 = db2.cursor()

## Create Tabel Barang

In [6]:
# Perintah SQL
sql = '''
CREATE TABLE IF NOT EXISTS `barang` (
  `id_barang` int(11) NOT NULL AUTO_INCREMENT,
  `id_kategori` smallint(6) NOT NULL,
  `nama_barang` varchar(255) CHARACTER SET latin1 NOT NULL,
  `harga` int(11) NOT NULL,
  `stok` int(11) NOT NULL,
  PRIMARY KEY (`id_barang`)
); 
'''

# Eksekusi perintah  SQL
cursor2.execute(sql)

# Simpan perubahan
db2.commit()

## Create Tabel Pelanggan

In [7]:
# Perintah SQL
sql = ''' 
CREATE TABLE IF NOT EXISTS `pelanggan` (
  `id_pelanggan` int(11) NOT NULL AUTO_INCREMENT,
  `nama` varchar(50) DEFAULT NULL,
  `email` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id_pelanggan`) 
); 
'''

# Eksekusi perintah  SQL
cursor2.execute(sql)

# Simpan perubahan
db2.commit()

## Create Tabel Penjualan

In [8]:
# Perintah SQL
sql = ''' 
CREATE TABLE IF NOT EXISTS `penjualan` (
  `id_transaksi` int(11) NOT NULL AUTO_INCREMENT,
  `id_pelanggan` int(11) DEFAULT NULL,
  `tgl_transaksi` date NOT NULL,
  `total_transaksi` int(11) NOT NULL,
  PRIMARY KEY (`id_transaksi`),
  KEY `FK_penjualan_pelanggan` (`id_pelanggan`),
  CONSTRAINT `FK_penjualan_pelanggan` FOREIGN KEY (`id_pelanggan`) REFERENCES `pelanggan` (`id_pelanggan`) ON DELETE SET NULL ON UPDATE CASCADE
); 
'''

# Eksekusi perintah  SQL
cursor2.execute(sql)

# Simpan perubahan
db2.commit()

## Create Tabel Penjualan Detail

In [9]:
# Perintah SQL
sql = ''' 
CREATE TABLE IF NOT EXISTS `penjualan_detail` (
  `id_transaksi_detail` int(11) NOT NULL AUTO_INCREMENT,
  `id_transaksi` int(11) DEFAULT NULL,
  `id_barang` int(11) DEFAULT NULL,
  `jml_barang` smallint(6) DEFAULT NULL,
  `harga_satuan` int(11) DEFAULT NULL,
  PRIMARY KEY (`id_transaksi_detail`),
  KEY `FK_tb_penjualan_detail_tb_barang` (`id_barang`),
  KEY `FK_tb_penjualan_detail_tb_penjualan` (`id_transaksi`),
  CONSTRAINT `FK_tb_penjualan_detail_tb_barang` FOREIGN KEY (`id_barang`) REFERENCES `barang` (`id_barang`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `FK_tb_penjualan_detail_tb_penjualan` FOREIGN KEY (`id_transaksi`) REFERENCES `penjualan` (`id_transaksi`) ON DELETE CASCADE ON UPDATE CASCADE
)
'''

# Eksekusi perintah  SQL
cursor2.execute(sql)

# Simpan perubahan
db2.commit()

## Insert Data Barang

In [10]:
sql = '''
INSERT INTO `barang` (`id_barang`, `id_kategori`, `nama_barang`, `harga`, `stok`) 
      VALUES (%s, %s, %s, %s, %s)'''
      
values = [(1, 1, 'RAM', 230000, 4),
            (2, 1, 'Mainboard', 1250000, 7),
            (3, 1, 'Mouse', 80000, 6),
            (4, 3, 'Mousepad', 35000, 3),
            (5, 3, 'Keyboard', 80000, 5)
         ]
         
for val in values:
  cursor2.execute(sql, val)
  db2.commit()

In [11]:
sql = '''
INSERT INTO `pelanggan` (`id_pelanggan`, `nama`, `email`)
      VALUES (%s, %s, %s)'''
      
values = [(1, 'Alfa', 'alfa@yahoo.com'),
            (2, 'Beta', 'beta@gmail.com'),
            (3, 'Delta', 'delta@hotmail.com'),
            (4, 'Bakti', 'dsciencelabs@outlook.com')
           ]
         
for val in values:
  cursor2.execute(sql, val)
  db2.commit()

In [12]:
sql = '''
INSERT INTO `penjualan` (`id_transaksi`, `id_pelanggan`, `tgl_transaksi`, `total_transaksi`)
      VALUES (%s, %s, %s, %s)'''
      
values = [(1, 1, '2023-06-22', 230000),
            (2, 3, '2023-06-22', 195000),
            (3, 2, '2023-05-01', 1710000),
            (4, 1, '2023-07-04', 310000),
            (5, 3, '2023-07-10', 80000)
           ]
         
for val in values:
  cursor2.execute(sql, val)
  db2.commit()

In [13]:
sql = '''
INSERT INTO `penjualan_detail` (`id_transaksi_detail`, `id_transaksi`, `id_barang`, `jml_barang`, `harga_satuan`)
      VALUES (%s, %s, %s, %s, %s); 
      '''
values = [(1, 1, 1, 1, 230000),
            (2, 2, 4, 1, 35000),
            (3, 2, 5, 2, 80000),
            (4, 3, 2, 1, 1250000),
            (5, 3, 1, 2, 230000),
            (6, 4, 4, 2, 35000),
            (7, 4, 5, 1, 80000),
            (8, 4, 3, 2, 80000),
            (9, 5, 3, 1, 80000)
           ]
         
for val in values:
  cursor2.execute(sql, val)
  db2.commit()

## Read Tabel

In [17]:
from sqlalchemy import create_engine
import pymysql
import pandas as pd

# membuat engine
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="bakti",
                               pw="123",
                               db="join_tabel"))

# engine koneksi ke database
en_co = engine.connect()

In [18]:
import pandas as pd
barang = pd.read_sql('barang', en_co)
barang

   id_barang  id_kategori nama_barang    harga  stok
0          1            1         RAM   230000     4
1          2            1   Mainboard  1250000     7
2          3            1       Mouse    80000     6
3          4            3    Mousepad    35000     3
4          5            3    Keyboard    80000     5

In [19]:
# Perintah SQL
sql = ''' 
SELECT pl.id_pelanggan, nama, tgl_transaksi, total_transaksi
  FROM pelanggan AS pl
    JOIN penjualan AS pn
      ON pl.id_pelanggan = pn.id_pelanggan
'''

# Eksekusi perintah  SQL
pd.read_sql(sql, en_co)

   id_pelanggan   nama tgl_transaksi  total_transaksi
0             1   Alfa    2023-06-22           230000
1             3  Delta    2023-06-22           195000
2             2   Beta    2023-05-01          1710000
3             1   Alfa    2023-07-04           310000
4             3  Delta    2023-07-10            80000

In [21]:
# Perintah SQL
sql = ''' 
SELECT pl.id_pelanggan, nama, tgl_transaksi, total_transaksi
  FROM pelanggan AS pl
    JOIN penjualan AS pn
      USING(id_pelanggan)
'''

# Eksekusi perintah  SQL
pd.read_sql(sql, en_co)

   id_pelanggan   nama tgl_transaksi  total_transaksi
0             1   Alfa    2023-06-22           230000
1             3  Delta    2023-06-22           195000
2             2   Beta    2023-05-01          1710000
3             1   Alfa    2023-07-04           310000
4             3  Delta    2023-07-10            80000

In [22]:
from sqlalchemy import create_engine
import pymysql
import pandas as pd

# membuat engine
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="bakti",
                               pw="123",
                               db="jne2"))

# engine koneksi ke database
en_co2 = engine.connect()

In [23]:
# Perintah SQL
sql = '''
SELECT order_id, product_id, status , sale_price
  FROM `order_items` 
  WHERE sale_price = (SELECT MAX(sale_price) FROM `order_items`)
'''

# Eksekusi perintah  SQL
pd.read_sql(sql, en_co2)

     order_id  product_id      status  sale_price
0        6582       18229     Shipped           7
1        6756        6243     Shipped           7
2       13199        9347     Shipped           7
3       14450       24954     Shipped           7
4       14876        9254     Shipped           7
..        ...         ...         ...         ...
211     91615       15547  Processing           7
212     99393       12537  Processing           7
213    100966       24905  Processing           7
214    102667       28848  Processing           7
215     15918        6951     Shipped           7

[216 rows x 4 columns]

In [24]:
# Perintah SQL
sql = '''
SELECT id, name,latitude, longitude 
  FROM `distribution_centers` 
    WHERE id IN (SELECT distribution_center_id FROM `products`)
'''

# Eksekusi perintah  SQL
pd.read_sql(sql, en_co2)

    id                                         name  latitude  longitude
0    1                                   Memphis TN        35        -89
1    2                                   Chicago IL        41        -87
2    3                                   Houston TX        29        -95
3    4                               Los Angeles CA        34       -118
4    5                               New Orleans LA        29        -90
5    6  Port Authority of New York/New Jersey NY/NJ        40        -73
6    1                                   Memphis TN        35        -89
7    2                                   Chicago IL        41        -87
8    3                                   Houston TX        29        -95
9    4                               Los Angeles CA        34       -118
10   5                               New Orleans LA        29        -90
11   6  Port Authority of New York/New Jersey NY/NJ        40        -73
12   1                                   Memphis TN        35        -89
13   2                                   Chicago IL        41        -87
14   3                                   Houston TX        29        -95
15   4                               Los Angeles CA        34       -118
16   5                               New Orleans LA        29        -90
17   6  Port Authority of New York/New Jersey NY/NJ        40        -73
18   1                                   Memphis TN        35        -89
19   2                                   Chicago IL        41        -87
20   3                                   Houston TX        29        -95
21   4                               Los Angeles CA        34       -118
22   5                               New Orleans LA        29        -90
23   6  Port Authority of New York/New Jersey NY/NJ        40        -73

In [25]:
# Perintah SQL
sql = '''
SELECT id,product_id, product_category, product_name 
  FROM `inventory_items` 
  WHERE product_retail_price <(SELECT AVG(product_retail_price) 
    FROM `inventory_items`)
'''

# Eksekusi perintah  SQL
pd.read_sql(sql, en_co2)

,id,product_id,product_category,product_name
0,30208,16898,Tops & Tees,Quiksilver Waterman Men's On The Rise
1,30209,16898,Tops & Tees,Quiksilver Waterman Men's On The Rise
2,341402,16898,Tops & Tees,Quiksilver Waterman Men's On The Rise
3,341403,16898,Tops & Tees,Quiksilver Waterman Men's On The Rise
4,408709,16898,Tops & Tees,Quiksilver Waterman Men's On The Rise
...,...,...,...,...
1123,461406,755,Tops & Tees,The Very Hungry Caterpillar Classic Book Women...
1124,472428,755,Tops & Tees,The Very Hungry Caterpillar Classic Book Women...
1125,472429,755,Tops & Tees,The Very Hungry Caterpillar Classic Book Women...
1126,472430,755,Tops & Tees,The Very Hungry Caterpillar Classic Book Women...
1127,472431,755,Tops & Tees,The Very Hungry Caterpillar Classic Book Women...

In [26]:
# Perintah SQL
sql = '''
SELECT id,product_id,product_name FROM `inventory_items` WHERE product_retail_price < (SELECT AVG(product_retail_price) FROM `inventory_items` WHERE product_category="Accessories")
'''

# Eksekusi perintah  SQL
pd.read_sql(sql, en_co2)

         id  product_id                                       product_name
0    150891       13921  NEW Aluminum Credit Card Wallet - RFID Blockin...
1    150892       13921  NEW Aluminum Credit Card Wallet - RFID Blockin...
2    150893       13921  NEW Aluminum Credit Card Wallet - RFID Blockin...
3    150894       13921  NEW Aluminum Credit Card Wallet - RFID Blockin...
4    253737       13921  NEW Aluminum Credit Card Wallet - RFID Blockin...
..      ...         ...                                                ...
155  282364       15757  NEW Aluminum Credit Card Wallet - RFID Blockin...
156  282365       15757  NEW Aluminum Credit Card Wallet - RFID Blockin...
157  377455       15757  NEW Aluminum Credit Card Wallet - RFID Blockin...
158  377456       15757  NEW Aluminum Credit Card Wallet - RFID Blockin...
159  377457       15757  NEW Aluminum Credit Card Wallet - RFID Blockin...

[160 rows x 3 columns]

In [27]:
160/39

4.102564102564102

In [32]:
# Perintah SQL
sql = ''' 
SELECT id, email
  FROM `users` 
    WHERE gender = 'F' AND country = 'Japan'
      ORDER BY 2
'''

# Eksekusi perintah  SQL
pd.read_sql(sql, en_co2)

       id                         email
0   77353     ashleyjohnson@example.com
1   77353     ashleyjohnson@example.com
2   77353     ashleyjohnson@example.com
3   77353     ashleyjohnson@example.com
4   38403  catherinebeltran@example.com
5   38403  catherinebeltran@example.com
6   38403  catherinebeltran@example.com
7   38403  catherinebeltran@example.com
8   27266     donnaschaefer@example.net
9   27266     donnaschaefer@example.net
10  27266     donnaschaefer@example.net
11  27266     donnaschaefer@example.net
12  73472      karenvasquez@example.net
13  73472      karenvasquez@example.net
14  73472      karenvasquez@example.net
15  73472      karenvasquez@example.net
16  91949      leahespinoza@example.com
17  91949      leahespinoza@example.com
18  91949      leahespinoza@example.com
19  91949      leahespinoza@example.com
20  63178           miahunt@example.com
21  63178           miahunt@example.com
22  63178           miahunt@example.com
23  63178           miahunt@example.com
24  74812    natashastanley@example.com
25  74812    natashastanley@example.com
26  74812    natashastanley@example.com
27  74812    natashastanley@example.com
28  58104   stephaniearroyo@example.net
29  58104   stephaniearroyo@example.net
30  58104   stephaniearroyo@example.net
31  58104   stephaniearroyo@example.net
32  71793         tonimoore@example.net
33  71793         tonimoore@example.net
34  71793         tonimoore@example.net
35  71793         tonimoore@example.net

In [33]:
# Perintah SQL
sql = ''' 
SELECT
  u.traffic_source, 
  COUNT(DISTINCT oi.user_id) total_customer
FROM `order_items` oi
LEFT JOIN `users` u
ON oi.user_id = u.id
WHERE oi.status NOT IN ('Cancelled','Returned')
GROUP BY 1
ORDER BY 2 DESC
'''

# Eksekusi perintah  SQL
pd.read_sql(sql, en_co2)

  traffic_source  total_customer
0           None             372
1         Search               2
2        Display               1

In [34]:
# Perintah SQL
sql = ''' 
SELECT oi.user_id, u.email,
  SUM(oi.sale_price*o.num_of_item) total_purchase
FROM `order_items` oi
  LEFT JOIN `users` u ON oi.user_id = u.id
  LEFT JOIN `orders` o ON oi.order_id = o.order_id
WHERE oi.status NOT IN ('Cancelled','Returned')
GROUP BY 1, 2
ORDER BY 3 DESC
LIMIT 10
'''

# Eksekusi perintah  SQL
pd.read_sql(sql, en_co2)

   user_id                      email  total_purchase
0     2101                       None            24.0
1     9931  donaldoconnor@example.org             NaN
2    18253   heatherclark@example.com             NaN
3    56395      tinamoore@example.net             NaN
4    53932                       None             NaN
5    71642                       None             NaN
6    83460                       None             NaN
7    40437                       None             NaN
8    56174                       None             NaN
9    26166                       None             NaN